albizon/ER4_Accordeur/projet/TP-info2/userHardware_/include/samd21/samd21Adc_define.h

#ifndef _SAMD21ADC_DEFINE_H_
#define _SAMD21ADC_DEFINE_H_

#define SAMD21_ADC_VREF_INT1V 0x0
#define SAMD21_ADC_VREF_INTVCC0 0x1
#define SAMD21_ADC_VREF_INTVCC1 0x2
#define SAMD21_ADC_VREF_VREFA 0x3
#define SAMD21_ADC_VREF_VREFB 0x4

#define SAMD21_ADC_MUX_AIN0 0x00
#define SAMD21_ADC_MUX_AIN1 0x01
#define SAMD21_ADC_MUX_AIN2 0x02
#define SAMD21_ADC_MUX_AIN3 0x03
#define SAMD21_ADC_MUX_AIN4 0x04
#define SAMD21_ADC_MUX_AIN5 0x05
#define SAMD21_ADC_MUX_AIN6 0x06
#define SAMD21_ADC_MUX_AIN7 0x07
#define SAMD21_ADC_MUX_AIN8 0x08
#define SAMD21_ADC_MUX_AIN9 0x09
#define SAMD21_ADC_MUX_AIN10 0x0A
#define SAMD21_ADC_MUX_AIN11 0x0B
#define SAMD21_ADC_MUX_AIN12 0x0C
#define SAMD21_ADC_MUX_AIN13 0x0D
#define SAMD21_ADC_MUX_AIN14 0x0E
#define SAMD21_ADC_MUX_AIN15 0x0F
#define SAMD21_ADC_MUX_AIN16 0x10
#define SAMD21_ADC_MUX_AIN17 0x11
#define SAMD21_ADC_MUX_AIN18 0x12
#define SAMD21_ADC_MUX_AIN19 0x13

#define SAMD21_ADC_MUX_GND 0x18
#define SAMD21_ADC_MUX_IOGND 0x19

#define SAMD21_ADC_MUX_TEMP 0x18
#define SAMD21_ADC_MUX_BANDGAP 0x19
#define SAMD21_ADC_MUX_SCALEDCOREVCC 0x1A
#define SAMD21_ADC_MUX_SCALEDIOVCC 0x1B
#define SAMD21_ADC_MUX_DAC 0x1C

#endif
